In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("international-airline-passengers.csv",engine='python',skipfooter=3)

In [4]:
df.tail() #see last five rows

,Month,International airline passengers: monthly totals in thousands. Jan 49 ? Dec 60
139,1960-08,606
140,1960-09,508
141,1960-10,461
142,1960-11,390
143,1960-12,432

In [5]:
df.columns

Index(['Month', 'International airline passengers: monthly totals in thousands. Jan 49 ? Dec 60'], dtype='object')

In [6]:
len(df.columns)

2

#### Reassinging column names

In [7]:
df.columns = ['month','passengers']

In [8]:
df.columns

Index(['month', 'passengers'], dtype='object')

In [9]:
df.head()

     month  passengers
0  1949-01         112
1  1949-02         118
2  1949-03         132
3  1949-04         129
4  1949-05         121

In [10]:
#df['passengers'].head()  OR
df.passengers.head()   # works only with string

0    112
1    118
2    132
3    129
4    121
Name: passengers, dtype: int64

#### adding columns manually 
eg: adding column of ones

In [11]:
df['ones']=1

In [12]:
df.head()

     month  passengers  ones
0  1949-01         112     1
1  1949-02         118     1
2  1949-03         132     1
3  1949-04         129     1
4  1949-05         121     1

### "Apply" func to create new rows from existing rows

In [13]:
from datetime import datetime

In [14]:
datetime.strptime('1949-05','%Y-%m')

datetime.datetime(1949, 5, 1, 0, 0)

In [15]:
df['dt'] = df.apply(lambda row: datetime.strptime(row['month'],'%Y-%m'),axis=1)

In [16]:
df.head()

     month  passengers  ones         dt
0  1949-01         112     1 1949-01-01
1  1949-02         118     1 1949-02-01
2  1949-03         132     1 1949-03-01
3  1949-04         129     1 1949-04-01
4  1949-05         121     1 1949-05-01